---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOut
source: html/cc5eda19-bd3e-2517-7fb0-68b853df6ea5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOut Property

"Main Secondary Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDiameterOut { get; }
```